/**
 * (BEGIN007) 檔尾封井尾封 : 
 * 輸入測資案例，案例以#分界切割。
 * 每一個案例內含數個數字。
 * 請針對每個案例，輸出案例中的總和。 
 * 
 * 標準輸入： 
 * 14 42 24 68 78 11 11 37 18 61 57 15 # 51 71 16 28 95 36 66 27 # 37 60 23 95 27 83 70 11 31 17 34 10 # 79 55 89 12 16 65 64 40 11 68 65 # 75 68 51 76 30 50 12 95 72 40 91 18 # 62 52 29 49 25 83 69 52 38 22 74 35 42 # 60 82 65 13 32 69 29 82 46 22 99 31 # 95 28 91 97 75 10 55 28 14 12 27 58 47 65 44 # 76 42 15 61 74 31 98 83 15 85 46 32 51 # 80 87 88 13 55 79 69 35 47 30 87 41 #
 * 標準輸出：
 * Sum=436↵\r\n
 * Sum=390↵\r\n
 * Sum=498↵\r\n
 * Sum=564↵\r\n
 * Sum=678↵\r\n
 * Sum=632↵\r\n
 * Sum=630↵\r\n
 * Sum=746↵\r\n
 * Sum=709↵\r\n
 * Sum=711↵\r\n
*/

#include <iostream>
#include <sstream>
using namespace std;
int main()
{
    int n;
    string s;
    while (getline(cin, s, '#'))
    {
        istringstream sin(s);
        int sum = 0;
        while (sin >> n)
            sum += n;
        cout << "Sum=" << sum << endl;
    }
    return 0;
}
